/******************************************************************************/
/* adc7k-cpci3u-base.c                                                        */
/******************************************************************************/

#include <linux/interrupt.h>
#include <linux/mm.h>
#include <linux/module.h>
#include <linux/pci.h>
#include <linux/poll.h>
#include <linux/sched.h>
#include <linux/slab.h>
#include <linux/version.h>

#include <asm/uaccess.h>

#include "adc7k/adc7k-base.h"

MODULE_AUTHOR("Maksym Tarasevych <mxmtar@gmail.com>");
MODULE_DESCRIPTION("ADC7K CompactPCI-3U board Linux module");
MODULE_LICENSE("GPL");

static int dmastart = 0x10000000;
module_param(dmastart, int, 0);
MODULE_PARM_DESC(dmastart, "ADC7K CompactPCI-3U board start address of external DMA buffer");

static int dmaend = 0x10ffffff;
module_param(dmaend, int, 0);
MODULE_PARM_DESC(dmaend, "ADC7K CompactPCI-3U board end address of external DMA buffer");

#define verbose(_fmt, _args...) printk(KERN_INFO "[%s] " _fmt, THIS_MODULE->name, ## _args)
#define log(_level, _fmt, _args...) printk(_level "[%s] %s:%d - %s(): " _fmt, THIS_MODULE->name, "adc7k-cpci3u-base.c", __LINE__, __PRETTY_FUNCTION__, ## _args)
#define debug(_fmt, _args...) printk(KERN_DEBUG "[%s] %s:%d - %s(): " _fmt, THIS_MODULE->name, "adc7k-cpci3u-base.c", __LINE__, __PRETTY_FUNCTION__, ## _args)

#define ADC7K_CPCI3U_BOARD_REGS_COUNT 32

#define ADC7K_CPCI3U_BOARD_MAX_SAMPLER_LENGTH 0x800000

struct resource *dma_region = NULL;

struct adc7k_cpci3u_channel {
	struct adc7k_channel *adc7k_channel;
	struct cdev cdev;

	spinlock_t lock;

	size_t usage;
	size_t mmap;
	size_t transactions;

	wait_queue_head_t poll_waitq;
	wait_queue_head_t read_waitq;

	size_t sampler_done;

	void *data;
	size_t data_length;

	unsigned long mem_start;
	size_t mem_length;
};

struct adc7k_cpci3u_board {
	struct adc7k_board *adc7k_board;
	struct cdev cdev;
	struct pci_dev *pci_dev;
	struct adc7k_cpci3u_channel *channel[ADC7K_CHANNEL_PER_BOARD_MAX_COUNT];
	size_t channel_current;

	spinlock_t lock;

	size_t sampling_rate;
	size_t sampler_length;
	size_t sampler_length_max;
	size_t sampler_divider;
	size_t sampler_continuous;

	void *dma_buffer[ADC7K_CHANNEL_PER_BOARD_MAX_COUNT];
	dma_addr_t dma_address[ADC7K_CHANNEL_PER_BOARD_MAX_COUNT];
	size_t dma_buffer_size;

	wait_queue_head_t dma_waitq;
	size_t dma_run;
	struct timer_list dma_timer;

	unsigned long base_io_addr;
	u8 irq_line;
	u8 irq_pin;

	struct {
		union {
			struct adc7k_cpci3u_reg0 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg0;
		union {
			struct adc7k_cpci3u_reg1 {
				u32 reset_all:1;		// 0
				u32 reset_int:1;		// 1
				u32 reserved0:1;		// 2
				u32 reset_dma:1;		// 3
				u32 ie_sampler:1;		// 4
				u32 ie_dma:1;			// 5
				u32 dma_start:1;		// 6
				u32 dma_chain:1;		// 7
				u32 sampler_start:1;	// 8
				u32 reserved1:3;		// 11 - 9
				u32 en_ad_cnt:1;		// 12
				u32 reserved2:12;		// 24 - 13
				u32 rst_ovf_led:1;		// 25
				u32 sel_mem_rd:2;		// 27, 26
				u32 reserved3:4;		// 31 - 28
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg1;
		union {
			struct adc7k_cpci3u_reg2 {
				u32 div:8;			// 7 - 0
				u32 reserved0:24;		// 31 - 8
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg2;
		union {
			struct adc7k_cpci3u_reg3 {
				u32 dma_done_0:1;		// 0
				u32 dma_done_1:1;		// 1
				u32 overflow:1;		// 2
				u32 reserved0:29;		// 31 - 3
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg3;
		union {
			struct adc7k_cpci3u_reg4 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg4;
		union {
			struct adc7k_cpci3u_reg5 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg5;
		union {
			struct adc7k_cpci3u_reg6 {
				u32 sampler_length:26;// 25 - 0
				u32 reserved0:6;		// 31 - 26
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg6;
		union {
			struct adc7k_cpci3u_reg7 {
				u32 dma_address:32;	// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg7;
		union {
			struct adc7k_cpci3u_reg8 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg8;
		union {
			struct adc7k_cpci3u_reg9 {
				u32 dma_length:32;	// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg9;
		union {
			struct adc7k_cpci3u_reg10 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg10;
		union {
			struct adc7k_cpci3u_reg11 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg11;
		union {
			struct adc7k_cpci3u_reg12 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg12;
		union {
			struct adc7k_cpci3u_reg13 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg13;
		union {
			struct adc7k_cpci3u_reg14 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg14;
		union {
			struct adc7k_cpci3u_reg15 {
				u32 reserved0:28;		// 0 - 27
				u32 adc_sclk:1;		// 28
				u32 adc_sdata:1;		// 29
				u32 adc_cs:1;			// 30
				u32 adc_reset:1;		// 31
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg15;
		union {
			struct adc7k_cpci3u_reg16 {
				u32 reserved0:5;		// 4 - 0
				u32 ddr_reset:1;		// 5
				u32 reserved1:26;		// 31 - 6
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg16;
		union {
			struct adc7k_cpci3u_reg17 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg17;
		union {
			struct adc7k_cpci3u_reg18 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg18;
		union {
			struct adc7k_cpci3u_reg19 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg19;
		union {
			struct adc7k_cpci3u_reg20 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg20;
		union {
			struct adc7k_cpci3u_reg21 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg21;
		union {
			struct adc7k_cpci3u_reg22 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg22;
		union {
			struct adc7k_cpci3u_reg23 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg23;
		union {
			struct adc7k_cpci3u_reg24 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg24;
		union {
			struct adc7k_cpci3u_reg25 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg25;
		union {
			struct adc7k_cpci3u_reg26 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg26;
		union {
			struct adc7k_cpci3u_reg27 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg27;
		union {
			struct adc7k_cpci3u_reg28 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg28;
		union {
			struct adc7k_cpci3u_reg29 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg29;
		union {
			struct adc7k_cpci3u_reg30 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg30;
		union {
			struct adc7k_cpci3u_reg31 {
				u32 reserved0:32;		// 31 - 0
			} __attribute__((packed)) bits;
			u32 full;
		} __attribute__((packed)) reg31;
	} __attribute__((packed)) reg_page;
	size_t reg_page_show;
};

struct adc7k_cpci3u_board_private_data {
	struct adc7k_cpci3u_board *board;
	char buff[0xc000];
	size_t length;
	loff_t f_pos;
};

static inline u32 adc7k_cpci3u_board_read_reg(struct adc7k_cpci3u_board *board, unsigned int index)
{
	u32 *pdata = (u32 *)&board->reg_page;

	pdata += index;

	*pdata = inl(board->base_io_addr + (index * 4));
	rmb();

	return *pdata;
}

static inline void adc7k_cpci3u_board_write_reg(struct adc7k_cpci3u_board *board, unsigned int index, u32 data)
{
	u32 *pdata = (u32 *)&board->reg_page;

	pdata += index;

	*pdata = data;

	outl(*pdata, board->base_io_addr + (index * 4));
	wmb();
}

static inline void adc7k_cpci3u_board_sync_reg(struct adc7k_cpci3u_board *board, unsigned int index)
{
	u32 *pdata = (u32 *)&board->reg_page;

	pdata += index;

